html/jcip/sharing_objects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>对象分享</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="thread_safe.html"> UP </a>
 |
 <a accesskey="H" href="jcip.html"> HOME </a>
</div><div id="content">
<h1 class="title">对象分享</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">可见性</a>
<ul>
<li><a href="#sec-1-1">过时的变量</a></li>
<li><a href="#sec-1-2">64位变量可能非原子</a></li>
<li><a href="#sec-1-3">加锁保证可见</a></li>
<li><a href="#sec-1-4">volatile变量　</a></li>
</ul>
</li>
<li><a href="#sec-2">this逃逸　</a></li>
<li><a href="#sec-3">线程限制　</a>
<ul>
<li><a href="#sec-3-1">栈限制，变量申明在方法内　</a></li>
<li><a href="#sec-3-2">ThreadLocal类</a></li>
</ul>
</li>
<li><a href="#sec-4">不变对象</a>
<ul>
<li><a href="#sec-4-1">volatile和不变对象进行同步</a></li>
</ul>
</li>
<li><a href="#sec-5">安全发布　</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">可见性</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">过时的变量</h3>
<div class="outline-text-3" id="text-1-1">
<p>
一个线程修改了变量的值, 另一个线程并非总是能够及时获知最新的值
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">NoVisibility</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">ready</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">number</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ReaderThread</span> <span style="color: #00ffff;">extends</span> <span style="color: #98fb98;">Thread</span> {
        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {
            <span style="color: #00ffff;">while</span> (!ready)
                Thread.yield();
            System.out.println(number);
        }
    }
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ReaderThread</span>().start();
        number = 42; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">reader&#32447;&#31243;&#26080;&#27861;&#30475;&#35265;</span>
        ready = <span style="color: #7fffd4;">true</span>;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">64位变量可能非原子</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">加锁保证可见</h3>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">volatile变量　</h3>
<div class="outline-text-3" id="text-1-4">
<p>
volatile无法保证操作的原子性, 只能保证变量的可见性!
</p>
<ol class="org-ol">
<li>更改不依赖于当前值, 或者能够确保只会在单一线程中修改变量的值
</li>
<li>变量不需要与其他状态变量共同参与不变约束 
</li>
</ol>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">asleep</span>;
...
<span style="color: #00ffff;">while</span> (!asleep)
    countSomeSheep();
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">this逃逸　</h2>
<div class="outline-text-2" id="text-2">
<p>
在构造函数返回之前其他线程就持有该对象的引用　
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ThisEscape</span> {  
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">ThisEscape</span>() {  
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">EscapeRunnable</span>()).start();  
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">...  </span>
    }  

    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">EscapeRunnable</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Runnable</span> {  
        <span style="color: #7fffd4;">@Override</span>  
        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {  
            <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#36890;&#36807;ThisEscape.this&#23601;&#21487;&#20197;&#24341;&#29992;&#22806;&#22260;&#31867;&#23545;&#35937;, &#20294;&#26159;&#27492;&#26102;&#22806;&#22260;&#31867;&#23545;&#35937;&#21487;&#33021;&#36824;&#27809;&#26377;&#26500;&#36896;&#23436;&#25104;, &#21363;&#21457;&#29983;&#20102;&#22806;&#22260;&#31867;&#30340;this&#24341;&#29992;&#30340;&#36867;&#36920;  </span>
        }  
    }
</pre>
</div>

<p>
使用一个private的构造器中启动线程或注册监听和public的工厂方法来调用构造器
</p>


<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ThisEscape</span> {  
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Thread</span> <span style="color: #eedd82;">t</span>;  
    <span style="color: #00ffff;">private</span> <span style="color: #87cefa;">ThisEscape</span>() {
        t = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">EscapeRunnable</span>());  
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">...  </span>
    }  

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">ThisEscape</span> <span style="color: #87cefa;">getInstance</span>() {
        <span style="color: #98fb98;">ThisEscape</span> <span style="color: #eedd82;">escape</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ThisEscape</span>();
        escape.t.start();
        <span style="color: #00ffff;">return</span> escape;
    }  

    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">EscapeRunnable</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Runnable</span> {  
        <span style="color: #7fffd4;">@Override</span>  
        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {  
            <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#36890;&#36807;ThisEscape.this&#23601;&#21487;&#20197;&#24341;&#29992;&#22806;&#22260;&#31867;&#23545;&#35937;, &#27492;&#26102;&#21487;&#20197;&#20445;&#35777;&#22806;&#22260;&#31867;&#23545;&#35937;&#24050;&#32463;&#26500;&#36896;&#23436;&#25104;  </span>
        }  
    }  
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">线程限制　</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">栈限制，变量申明在方法内　</h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">ThreadLocal类</h3>
<div class="outline-text-3" id="text-3-2">
<p>
线程不安全的JDBC Connection可以放在ThreadLocal里面　
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">不变对象</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>构造完成后所有属性无法改变，所有属性都是final
</li>
<li>不会出现this逃逸　
</li>
</ol>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">volatile和不变对象进行同步</h3>
<div class="outline-text-3" id="text-4-1">
<p>
当对象状态发生变化的时候，重新构造一个新的不变对象，用volatile保证每个新构造的不变对象可见性
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #7fffd4;">@Immutable</span>
<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">OneValueCache</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">BigInteger</span> <span style="color: #eedd82;">lastNumber</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">BigInteger</span>[] <span style="color: #eedd82;">lastFactors</span>;
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">OneValueCache</span>(<span style="color: #98fb98;">BigInteger</span> <span style="color: #eedd82;">i</span>,
                 <span style="color: #98fb98;">BigInteger</span>[] <span style="color: #eedd82;">factors</span>) {
        lastNumber = i;
        lastFactors = Arrays.copyOf(factors, factors.length);
    }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">BigInteger</span>[] <span style="color: #87cefa;">getFactors</span>(<span style="color: #98fb98;">BigInteger</span> <span style="color: #eedd82;">i</span>) {
        <span style="color: #00ffff;">if</span> (lastNumber == <span style="color: #7fffd4;">null</span> || !lastNumber.equals(i))
            <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">null</span>;
        <span style="color: #00ffff;">else</span>
            <span style="color: #00ffff;">return</span> Arrays.copyOf(lastFactors, lastFactors.length);
    }
}

<span style="color: #7fffd4;">@ThreadSafe</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">VolatileCachedFactorizer</span> <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">Servlet</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">OneValueCache</span> <span style="color: #eedd82;">cache</span> =
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">OneValueCache</span>(<span style="color: #7fffd4;">null</span>, <span style="color: #7fffd4;">null</span>);
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">service</span>(<span style="color: #98fb98;">ServletRequest</span> <span style="color: #eedd82;">req</span>, <span style="color: #98fb98;">ServletResponse</span> <span style="color: #eedd82;">resp</span>) {
        <span style="color: #98fb98;">BigInteger</span> <span style="color: #eedd82;">i</span> = extractFromRequest(req);
        <span style="color: #98fb98;">BigInteger</span>[] <span style="color: #eedd82;">factors</span> = cache.getFactors(i);
        <span style="color: #00ffff;">if</span> (factors == <span style="color: #7fffd4;">null</span>) {
            factors = factor(i);
            cache = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">OneValueCache</span>(i, factors);
        }
        encodeIntoResponse(resp, factors);
    }
}
</pre>
</div>
<p>
　
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">安全发布　</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>线程限制. 如果限制对象只可由单一的线程访问, 那么无论公开哪个成员, 都不会产生并发问题
</li>
<li>公开不可变成员. 如果对象的某个成员是不可变的, 那么公开该成员不会产生并发问题
</li>
<li>公开事实上的不可变成员. 如果对象的某个成员是可变的, 但约定访问该成员的所有线程不要去修改这个成员, 那么该成员是事实上不可变的. 这种场景下公开该成员不会产生并发问题
</li>
<li>公开线程安全的成员. 线程安全的成员内部会妥善并发问题, 因此公开线程安全的成员是恰当的
</li>
<li>公开可变的非线程安全的成员. 这就要求所有访问该成员的线程使用特定的锁进行同步
</li>
</ol>
<p>
　
<a href="composing_objects.html">Next:对象组合</a>
</p>

<p>
<a href="thread_safe.html">Previous:线程安全</a>
</p>

<p>
<a href="jcip.html">Up:目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
     <!-- DISQUS  -->
     <div id="disqus_thread"></div>
     <script type="text/javascript">
         /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
         var disqus_shortname = 'https-klose911-github-io'; // required: replace example with your forum shortname

         /* * * DON'T EDIT BELOW THIS LINE * * */
         (function() {
             var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
             dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
             (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
         })();
     </script>
     <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
     <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
